orderPricePlan/templates/payloads/ChangeSubOffering.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bcs="http://www.huawei.com/bme/cbsinterface/bcservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:bcc="http://www.huawei.com/bme/cbsinterface/bccommon">
   <soapenv:Header/>
   <soapenv:Body>
      <bcs:ChangeSubOfferingRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:BusinessCode>ChangeSubOffering</cbs:BusinessCode>
            <cbs:MessageSeq>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss.SSS").format(new Date())}</cbs:MessageSeq>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <ChangeSubOfferingRequest>
            <bcs:SubAccessCode>
               <bcc:PrimaryIdentity>9235000018</bcc:PrimaryIdentity>
            </bcs:SubAccessCode>
            <bcs:SupplementaryOffering>
               <bcs:AddOffering>
                  <bcc:OfferingKey>
                     <!--bcc:OfferingID>1383721433</bcc:OfferingID-->
                     <bcc:OfferingCode>sms_rate_language</bcc:OfferingCode>
                     <bcc:PurchaseSeq>202459420002</bcc:PurchaseSeq>
                  </bcc:OfferingKey>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_CHANNEL_ID</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>channe0924</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>C_FREE_FIRSTMRC</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>1</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_PAY_FLAG</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>1</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_AU</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>bankau20</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_FIRST_AMOUNT</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>5000000</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_BANK_ID</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>20240924</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_CALLER_ID</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>test20240924</bcc:Value>
                  </bcc:OInstProperty>
                  <bcs:EffectiveTime>
                     <bcc:Mode>I</bcc:Mode>
                  </bcs:EffectiveTime>
               </bcs:AddOffering>
            </bcs:SupplementaryOffering>
            <bcs:OperationCode>4052485</bcs:OperationCode>
         </ChangeSubOfferingRequest>
      </bcs:ChangeSubOfferingRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>